[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="活力之毒"
mTooltip="当此生物造成伤害时，受影响的敌人获得%spell1.name，该效果会在其回合开始时为爬行九头蛇恢复%buff1.buff.d %ICON_Health点生命值。(对亡灵和构装体单位无效。)"

[Ability.poison_revigorant_buff H7BaseBuff]
mName="活力之毒"
mTooltip="此生物在其回合开始时为爬行九头蛇恢复%d %ICON_Health点生命值。"

[Ability2.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="毒液震荡"
mTooltip="对所有敌方生物造成%d1 %icon_air点气系伤害，每有一种毒素效果影响他们，就多造成一次伤害。"

[Creatures.A_Creature_hydra_citadelle H7Creature]
mName="爬行九头蛇"
mLore="爬行九头蛇是猖獗且贪婪的怪物。无论它们吞噬多少，似乎总是渴望更多。它们的毒液光环会迅速破坏大多数自然环境，在短时间内将其变为贫瘠的荒地。它的许多头在前进时猛烈撕咬。它利用自身质量碾压敌人，同时吸取他们的生命能量。\n\n雇佣所需稀有资源：\n5影钢"